# Before you start :
   - These exercises are related to the Pivot table and correlation lessons.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly enjoy the process!!!
  
#### Import all the necessary libraries here:

In [14]:
# Libraries
import pandas as pd
import matplotlib as plt
import numpy as np

# Challenge 1

#### Read the `employees` dataset from Ironhack's database:
* db: `employees`
* table: `employees`

Save your data in a variable called `employees`.

In [4]:
# your code here
from sqlalchemy import create_engine
driver = 'mysql+pymysql'
ip = '34.65.10.136'
username = 'data-students'
password = 'iR0nH@cK-D4T4B4S3'
db = 'employees'
connection_string  = f'{driver}://{username}:{password}@{ip}/{db}'
engine = create_engine(connection_string)

In [5]:
query = 'Select * from employees.employees'
employees = pd.DataFrame(pd.read_sql(query, engine))
employees.head()

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55

#### What's the mean `Salary` by `Department`?
**Tip**: There are 2 ways to do it: with or without pivot tables. Do it both ways.

In [6]:
# Method 1
# your code here
employees['Salary'].groupby(employees['Department']).mean()

Department
HR       45.00
IT       48.75
Sales    55.00
Name: Salary, dtype: float64

In [7]:
# Method 2
# your code here
pd.pivot_table(data = employees, values = 'Salary', index = 'Department')

            Salary
Department
HR           45.00
IT           48.75
Sales        55.00

#### Now, group the data by more than one column. Use Pandas pivot table function to select the mean `Salary` by `Department` and `Title`.

In [8]:
# your code here
pd.pivot_table(data = employees, values = 'Salary', index = ['Department', 'Title'])

                      Salary
Department Title
HR         VP           70.0
           analyst      32.5
IT         VP           70.0
           analyst      32.5
           associate    60.0
Sales      associate    55.0

#### Display the number of `Years` of work experience and the `Salary` for each `Title`. Add `Years` as a column in your pivot table.
**Hint**: Use Pandas documentation to explore the [pivot table](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.pivot_table.html) function.

In [11]:
# your code here
pd.pivot_table(data = employees, values = ['Salary', 'Years'], index = 'Title')

              Salary  Years
Title
VP         70.000000   8.00
analyst    32.500000   2.25
associate  56.666667   4.00

#### Find the mean `Salary` and number of employees in each `Department` and for each job `Title`.

In [18]:
# your code here
pd.pivot_table(data = employees, values = ['Salary','Name'], index = 'Title', aggfunc = {'Salary':np.mean,'Name':'count'})

           Name     Salary
Title
VP            2  70.000000
analyst       4  32.500000
associate     3  56.666667

#### For each `Department` and each job `Title`, find the `Salary` median, minimum, maximum and standard deviation. Comment your results.

In [21]:
# your code here
pd.pivot_table(data = employees, values = ['Salary'], index = ['Title', 'Department'], aggfunc = {'Salary':['median', 'min','max',  'std']})

                     Salary
                        max median   min       std
Title     Department
VP        HR           70.0   70.0  70.0       NaN
          IT           70.0   70.0  70.0       NaN
analyst   HR           35.0   32.5  30.0  3.535534
          IT           35.0   32.5  30.0  3.535534
associate IT           60.0   60.0  60.0       NaN
          Sales        55.0   55.0  55.0  0.000000

In [ ]:
"""
your commments here
"""

#### Based on your comments, fill the missing values with an appropriate value.

In [ ]:
# your code here

#### The stake holders want to know, for each `Department`, the number of employees and how much money is spent on salaries. Could you provide that information?

In [ ]:
# your code here
pd.pivot_table(data = employees, values = ['Salary'], index = ['Title', 'Department'], aggfunc = {'Salary':['median', 'min','max',  'std']})

#### For each `Department` and `Title`, find the the total years of work experience and the mean `Salary`.

In [ ]:
# your code here

## Bonus Challenge 1

#### Compute the mean `Salary` after removing the maximum `Salary` for each `Department`. Create the appropriate pivot table.
**Hint**: Write a custom function.

In [ ]:
# your code here

# Challenge 2

#### Read the `fitbit` dataset from Ironhack's database:
* db: `fitbit`
* table: `fitbit`

Save your data in a variable called `fitbit`.

In [22]:
# your code here
driver = 'mysql+pymysql'
ip = '34.65.10.136'
username = 'data-students'
password = 'iR0nH@cK-D4T4B4S3'
db = 'fitbit'
connection_string  = f'{driver}://{username}:{password}@{ip}/{db}'
engine = create_engine(connection_string)
query = 'Select * from fitbit.fitbit'
fitbit = pd.DataFrame(pd.read_sql(query, engine))
fitbit.head()

In [23]:
query = 'Select * from fitbit.fitbit'
fitbit = pd.DataFrame(pd.read_sql(query, engine))
fitbit.head()

,Date,Calorie burned,Steps,Distance,Floors,Minutes Sedentary,Minutes Lightly Active,Minutes Fairly Active,Minutes Very Active,Activity Calories,MinutesOfSleep,MinutesOfBeingAwake,NumberOfAwakings,LengthOfRestInMinutes
0,08-05-2015,1934,905,0.65,0,1.355,46,0,0,1680,384,26,23,417\r
1,09-05-2015,3631,18925,14.11,4,611.0,316,61,60,2248,454,35,21,491\r
2,10-05-2015,3204,14228,10.57,1,602.0,226,14,77,1719,387,46,25,436\r
3,11-05-2015,2673,6756,5.02,8,749.0,190,23,4,9620,311,31,21,350\r
4,12-05-2015,2495,502,3.73,1,876.0,171,0,0,7360,407,65,44,491\r

#### Explore you dataset in terms of data types and descriptive statistics.
**Hint**: Use Pandas functions from previous lectures.

In [24]:
# your code here
fitbit.describe()

,Calorie burned,Steps,Floors,Minutes Lightly Active,Minutes Fairly Active,Minutes Very Active,Activity Calories,MinutesOfSleep,MinutesOfBeingAwake,NumberOfAwakings
count,367.000000,367.000000,367.000000,367.000000,367.000000,367.000000,367.000000,367.000000,367.000000,367.000000
mean,2741.501362,10121.588556,11.724796,236.405995,26.163488,35.722071,2044.147139,290.479564,28.008174,16.196185
std,916.307036,5594.836225,10.337370,86.531376,20.319456,31.006682,2041.267168,154.752328,18.541415,10.757622
min,179.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,2698.000000,6730.500000,5.000000,179.000000,8.000000,10.500000,1218.500000,224.000000,14.000000,7.000000
50%,2974.000000,10413.000000,11.000000,226.000000,24.000000,29.000000,1553.000000,337.000000,29.000000,16.000000
75%,3233.000000,13916.500000,16.000000,290.000000,41.500000,54.000000,1927.500000,400.500000,41.500000,24.000000
max,4351.000000,26444.000000,101.000000,472.000000,101.000000,153.000000,9830.000000,553.000000,78.000000,45.000000

#### You suspect that there must be a linear relationship between the `Minutes Very Active` and the `Steps`. Compute the correlation between these variables.

In [25]:
# your code here
fitbit[['Minutes Very Active', 'Steps']].corr()

                     Minutes Very Active     Steps
Minutes Very Active             1.000000  0.571452
Steps                           0.571452  1.000000

#### Use matplotlib to visually plot `Minutes Very active` vs `Steps`. We'll work with matplotlib next week. As a first introduction, uncomment and complete the following code. You need to replace the # symbol for the correct function arguments.

In [ ]:
import matplotlib.pyplot as plt;

In [ ]:
"""
plt.scatter(#, #)
plt.title(#)
plt.xlabel(#)
plt.ylabel(#)
plt.show()
"""

#### What can you say about `Minutes Very Active` and `Steps`? Write a comment below.

In [ ]:
"""
your commments here
"""

#### We also suspect that there must be a linear relationship between the `Minutes Sedentary` and the `Steps`. Compute the correlation between these variables.

In [29]:
# your code here
fitbit[['Minutes Lightly Active', 'Steps']].corr()

                        Minutes Lightly Active    Steps
Minutes Lightly Active                 1.00000  0.39301
Steps                                  0.39301  1.00000

#### Use matplotlib to visually plot `Minutes Sedentary` vs `Steps`. Based on the results of the computed correlation and the plot, what can you say about these 2 variables?

In [ ]:
# your code here

In [ ]:
"""
your commments here
"""

#### We also suspect that there must be a linear relationship between the `MinutesOfSleep` and the `Steps`. Compute the correlation between these variables.

In [30]:
# your code here
fitbit[['MinutesOfSleep', 'Steps']].corr()

                MinutesOfSleep     Steps
MinutesOfSleep        1.000000  0.130986
Steps                 0.130986  1.000000

#### Use matplotlib to visually plot `MinutesOfSleep` vs `Steps`. Based on the results of the computed correlation and the plot, what can you say about these 2 variables?

In [ ]:
# your code here

In [ ]:
"""
your commments here
"""

#### Select a subset of your dataset with the columns below and compute the correlation matrix. Save the results in the variable `cor_fit`.

In [33]:
columns = ['Calorie burned', 'Steps', 'Floors', 'Minutes Sedentary', 'Minutes Very Active', 'MinutesOfSleep']
df = fitbit[['Calorie burned', 'Steps', 'Floors', 'Minutes Sedentary', 'Minutes Very Active', 'MinutesOfSleep']]

In [35]:
# your code here
cor_fit = df.corr()
cor_fit.head()

,Calorie burned,Steps,Floors,Minutes Very Active,MinutesOfSleep
Calorie burned,1.000000,0.255305,0.130757,0.197881,0.011485
Steps,0.255305,1.000000,0.306511,0.571452,0.130986
Floors,0.130757,0.306511,1.000000,0.399503,0.069464
Minutes Very Active,0.197881,0.571452,0.399503,1.000000,0.108018
MinutesOfSleep,0.011485,0.130986,0.069464,0.108018,1.000000

#### Based on the result of the correlation matrix, which of the features are highly correlated with variable `Steps`?
**Hint**: sort the correlations of `Steps` vs the rest of the features in descending order. You can use Pandas `sort_values`.

In [ ]:
# your code here

# Challenge 3

#### Read the `time_grades` dataset from Ironhack's database:
* db: `time_grades`
* table: `time_grades`

Save your data in a variable called `time_grades`.

In [36]:
# your code here
driver = 'mysql+pymysql'
ip = '34.65.10.136'
username = 'data-students'
password = 'iR0nH@cK-D4T4B4S3'
db = 'fitbit'
connection_string  = f'{driver}://{username}:{password}@{ip}/{db}'
engine = create_engine(connection_string)
query = 'Select * from time_grades.time_grades'
time_grades = pd.DataFrame(pd.read_sql(query, engine))
time_grades.head()

     Name  Study time Grade
0    Jose           4   4\r
1   Maria           9   7\r
2   David           8   9\r
3   Sonia          10   7\r
4  Samuel          20   9\r

In [40]:
time_grades.dtypes

Name          object
Study time     int64
Grade         object
dtype: object

#### Show visually the frequency distribution of the `time_grades` dataset.

In [ ]:
# your code here

#### Is there a correlation between `Study time` and `Grade`? Use both Pearson and Spearman correlations and comment your results.

In [38]:
# your code here
time_grades[['Study time', 'Grade']].corr()

            Study time
Study time         1.0

In [ ]:
"""
your commments here
"""

#### Use matplotlib to visually plot `Study time` vs `Grade`. Based on the results of the computed correlation and the plot, what can you say about these 2 variables?

In [ ]:
# your code here

In [ ]:
"""
your commments here
"""

#### Could you explain the difference between Pearson and Spearman correlations?

In [ ]:
"""
your commments here
"""